module Chapter6 where

-- 1.
(<^>) :: Integral a => a -> a -> a
_ <^> 0 = 1
x <^> y = x * x <^> (y - 1)

{-

2^3
  = { ^ を適用 }
2 * 2^2
  = { ^ を適用 }
2 * (2 * 2^1)
  = { ^ を適用 }
2 * (2 * (2 * 2^0))
  = { ^ を適用 }
2 * (2 * (2 * 1))
  = { * を適用 }
8

-}

-- 2.

{-

length [1, 2, 3]
  = { length を適用 }
1 + length [2, 3]
  = { length を適用 }
1 + (1 + length [3])
  = { length を適用 }
1 + (1 + (1 + length []))
  = { length を適用 }
1 + (1 + (1 + 0))
  = { + を適用 }
3

drop 3 [1, 2, 3, 4, 5]
  = { drop を適用 }
drop 2 [2, 3, 4, 5]
  = { drop を適用 }
drop 1 [3, 4, 5]
  = { drop を適用 }
drop 0 [4, 5]
  = { drop を適用 }
[4, 5]

init [1, 2, 3]
  = { init を適用 }
1 : init [2, 3]
  = { init を適用 }
1 : (2 : init [3])
  = { init を適用 }
1 : (2 : [])
  = { : を適用 }
[1, 2]

-}

